_content/articles/Jump-Links-And-Viewport-Position.org
#+TITLE: Jump Links And Viewport Position
#+DATE: 2015-12-27
#+DESCRIPTION: 一些关于css的小知识
#+KEYWORDS: css,links,viwport-position
#+OPTIONS: H:4 num:t toc:t \n:nil @:t ::t |:t ^:nil f:t TeX:t email:t timestamp:t
#+LINK_HOME: https://creamidea.github.io
#+STARTUP: showall


* 前言
  最近写主页的时候配到一个问题，如可控制HTML中的锚点跳转之后的对象的位置。
  比如我点击了一个标题，我希望这个跳转过去的标题能够距离顶部一段距离。

* Jump links and viewport position
** A
#+BEGIN_SRC css
  default
#+END_SRC
** B
#+BEGIN_SRC css
#method-B:before {
    display: block;
    content: "";
    height: 50px;
    margin: -50px 0 0;
}
#+END_SRC
** C
#+BEGIN_SRC css
#method-C {
    padding-top: 50px;
    margin-top: -50px;
    \-webkit-background-clip: content-box;
    background-clip: content-box;
}
#+END_SRC
** D
#+BEGIN_SRC css
#method-D {
    border-top: 50px solid transparent;
    margin-top: -50px;
    \-webkit-background-clip: padding-box;
    \-moz-background-clip: padding;
    background-clip: padding-box;
}
#+END_SRC
** E
#+BEGIN_SRC css
  #method-E {
      position: relative;
      padding: 15px;
      border-top: 52px solid transparent;
      margin-top: -50px;
      \-webkit-background-clip: padding-box;
      \-moz-background-clip: padding;
      background-clip: padding-box;
  }

  #method-E:before {
      content: "";
      position: absolute;
      top: -25px;
      left: 0;
      right: 0;
      border-top: 1px solid #ccc;
  }
#+END_SRC
Reference:
+ http://nicolasgallagher.com/jump-links-and-viewport-positioning/demo/
+ https://css-tricks.com/hash-tag-links-padding/
