static/html/articles/Jump-Links-And-Viewport-Position.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-10-09 Sun 22:56 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Jump Links And Viewport Position</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Junjia Ni">
<meta  name="description" content="一些关于css的小知识"
>
<meta  name="keywords" content="css,links,viwport-position">
<link rel="stylesheet" type="text/css" href="/static/article.css">
</head>
<body>
<div id="content">
<h1 class="title">Jump Links And Viewport Position</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline7">2. Jump links and viewport position</a>
<ul>
<li><a href="#orgheadline2">2.1. A</a></li>
<li><a href="#orgheadline3">2.2. B</a></li>
<li><a href="#orgheadline4">2.3. C</a></li>
<li><a href="#orgheadline5">2.4. D</a></li>
<li><a href="#orgheadline6">2.5. E</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
最近写主页的时候配到一个问题，如可控制HTML中的锚点跳转之后的对象的位置。
比如我点击了一个标题，我希望这个跳转过去的标题能够距离顶部一段距离。
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> Jump links and viewport position</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> A</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-css">default
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> B</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #de935f;">#method-B:before </span><span style="color: #c5c8c6;">{</span>
    <span style="color: #f0c674;">display</span>: block;
    <span style="color: #f0c674;">content</span>: <span style="color: #8abeb7;">""</span>;
    <span style="color: #f0c674;">height</span>: 50px;
    <span style="color: #f0c674;">margin</span>: -50px 0 0;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> C</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #de935f;">#method-C </span><span style="color: #c5c8c6;">{</span>
    <span style="color: #f0c674;">padding-top</span>: 50px;
    <span style="color: #f0c674;">margin-top</span>: -50px;
    <span style="color: #f0c674;">\-webkit-background-clip</span>: content-box;
    <span style="color: #f0c674;">background-clip</span>: content-box;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.4</span> D</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #de935f;">#method-D </span><span style="color: #c5c8c6;">{</span>
    <span style="color: #f0c674;">border-top</span>: 50px solid transparent;
    <span style="color: #f0c674;">margin-top</span>: -50px;
    <span style="color: #f0c674;">\-webkit-background-clip</span>: padding-box;
    <span style="color: #f0c674;">\-moz-background-clip</span>: padding;
    <span style="color: #f0c674;">background-clip</span>: padding-box;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.5</span> E</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #de935f;">#method-E </span><span style="color: #c5c8c6;">{</span>
    <span style="color: #f0c674;">position</span>: relative;
    <span style="color: #f0c674;">padding</span>: 15px;
    <span style="color: #f0c674;">border-top</span>: 52px solid transparent;
    <span style="color: #f0c674;">margin-top</span>: -50px;
    <span style="color: #f0c674;">\-webkit-background-clip</span>: padding-box;
    <span style="color: #f0c674;">\-moz-background-clip</span>: padding;
    <span style="color: #f0c674;">background-clip</span>: padding-box;
<span style="color: #c5c8c6;">}</span>

<span style="color: #de935f;">#method-E:before </span><span style="color: #c5c8c6;">{</span>
    <span style="color: #f0c674;">content</span>: <span style="color: #8abeb7;">""</span>;
    <span style="color: #f0c674;">position</span>: absolute;
    <span style="color: #f0c674;">top</span>: -25px;
    <span style="color: #f0c674;">left</span>: 0;
    <span style="color: #f0c674;">right</span>: 0;
    <span style="color: #f0c674;">border-top</span>: 1px solid <span style="color: #000000; background-color: #ccc;">#ccc</span>;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>
<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="http://nicolasgallagher.com/jump-links-and-viewport-positioning/demo/">http://nicolasgallagher.com/jump-links-and-viewport-positioning/demo/</a></li>
<li><a href="https://css-tricks.com/hash-tag-links-padding/">https://css-tricks.com/hash-tag-links-padding/</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">Junjia Ni</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2016-10-09 Sun 22:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</p>
<p class="validation"></p>
<p class="last-modification-time">2016-05-08 Sun 18:34</p></div><script asyn src="/static/article.js"></script><!-- Google Analytics --><script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><script async src='//www.google-analytics.com/analytics.js'></script><!-- End Google Analytics -->
</div>
</body>
</html>
